Tekla.Structures.Model.RebarGuideline.GuidelineChamferTypeEnum
The guideline chamfer types.
For use when creating longitudinal bars on the top/bottom face of a flat polybeam.

Tekla.Structures.Model.RebarGuideline.GuidelineChamferTypeEnum.NONE
No chamfer.

Tekla.Structures.Model.RebarGuideline.GuidelineChamferTypeEnum.ARC_POINT
Arc point chamfer.